package Homework_9;

// Написать программу-бот, который помогает выбрасывать мусор в баки разных цветов:
//упаковки в желтый бак
//пищевые отходы в коричневый бак
//бумага в зеленый бак
//прочие отходы в черный бак Используйте цифры для кодирования вариантов действий.


import java.sql.SQLOutput;
import java.util.Scanner;

public class Müll {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        String müll ;
        System.out.println("Welkome!!! Which container will suit you?");
        System.out.print("1- Yelloy(packagung); 2- Brown(food waste);3- Green(paper);4- Black(others)");


    }
}












